Tekla Open API Reference for Tekla Structures 2025
DrawingObjectSelector.GetSelected Method
 Gets the selected objects in the drawing.
 Namespace: Tekla.Structures.Drawing.UI
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DrawingObjectEnumerator GetSelected()
Public Function GetSelected As DrawingObjectEnumerator
Return Value
Type: DrawingObjectEnumerator
A drawing object enumerator of the selected objects in the drawing.
See Also
Reference
DrawingObjectSelector Class
Tekla.Structures.Drawing.UI Namespace